// creditos a https://github.com/FG98F
let handler = async (m, { conn, isPrems}) => {
//let hasil = Math.floor(Math.random() * 5000)
let pp = 'https://c4.wallpaperflare.com/wallpaper/991/456/22/sketch-artist-anime-anime-girls-arknights-swire-arknights-hd-wallpaper-preview.jpg'
let gata = Math.floor(Math.random() * 3000)
global.db.data.users[m.sender].exp += gata * 1  
let time = global.db.data.users[m.sender].lastwork + 600000
if (new Date - global.db.data.users[m.sender].lastwork < 600000) throw `*انت استخدمت الامر ده منذ قليل انتظر ${msToTime(time - new Date())} حتي تستطيع استخدامه مجددا!!*`

await conn.reply(m.chat, `*${pickRandom(global.work)}* ${gata} XP`, fkontak, pp, m)
/*conn.sendHydrated(m.chat, wm, `${pickRandom(global.work)} ${gata} XP`, pp, md, '饾檪饾櫈饾櫓饾檭饾櫔饾櫁', null, null, [
['饾棤 饾棙 饾棥 饾棬 鈽橈笍', `#menu`]
], m,) */
global.db.data.users[m.sender].lastwork = new Date * 1
}
handler.help = ['work']
handler.tags = ['xp']
handler.command = ['عمل', 'شغل']
handler.fail = null
handler.exp = 0
export default handler

function msToTime(duration) {
var milliseconds = parseInt((duration % 1000) / 100),
seconds = Math.floor((duration / 1000) % 60),
minutes = Math.floor((duration / (1000 * 60)) % 60),
hours = Math.floor((duration / (1000 * 60 * 60)) % 24)
hours = (hours < 10) ? "0" + hours : hours
minutes = (minutes < 10) ? "0" + minutes : minutes
seconds = (seconds < 10) ? "0" + seconds : seconds

return minutes + " m " + seconds + " s " 
}


function pickRandom(list) {
return list[Math.floor(list.length * Math.random())]
}

global.work = ["تعمل كقاطع بسكويت وتكسب",
"تعتني بالمجموعة عندما لا يكون المشرفون موجودين لذلك تكسب",
"تعمل لشركة عسكرية خاصة، وتكسب",
"تنظم حدث تذوق النبيذ وتحصل على",
"قمت بإدارة المجموعة عندما لم يكن FOX-BOT موجودًا، وكان الدفع",
"كان يسير في الشارع ووجد",
"تساعدك مع المجموعة أثناء غياب المشرفين وكان الدفع",
"يختطفونك ويأخذونك إلى مدرج تحت الأرض حيث قاتلت ضد وحوش مع أشخاص لم تعرفهم من قبل. تكسب",
"تنظف المدخنة وتجد",
"تطور الألعاب لكسب العيش وتكسب",
"لماذا يسمى هذا الأمر وظيفة؟ أنت لا تفعل شيئًا متعلقًا بالعمل. ومع ذلك، تكسب",
"عملت في المكتب ساعات إضافية من أجل",
"تعمل كخاطف للعروس وتكسب",
"جاء شخص ومثل مسرحية. مقابل المشاهدة، أعطوك",
"اشتريت وبعت المقالات وكسبت",
"تعمل في مطعم الجدة كطباخ وتكسب",
"تعمل لمدة 10 دقائق في بيتزا هت المحلي. كسبت",
"تعمل ككاتب لكعك الحظ وتكسب",
"ترى شخصًا يكافح لرفع صندوق إلى سيارته، تسرع لمساعدته قبل أن يصاب. بعد مساعدتهم، يعطونك بلطف",
"تطور الألعاب لكسب العيش وتكسب",
"تفوز في مسابقة لتناول الفلفل الحار. الجائزة هي",
"تعمل طوال اليوم في الشركة من أجل",
"تساعد في إدارة مجموعة FOX-BOT من أجل",
"صممت شعارًا لـ FG من أجل",
"قمت بإدارة المجموعة عندما لم يكن GataDios موجودًا، وكان الدفع",
"عملت بجد في مطبعة كانت توظف، وحصلت على ما تستحقه!",
"تعمل كقصاص شجيرات لـ FG98 وتكسب",
"ازداد الطلب على الألعاب لأجهزة الهواتف المحمولة، لذا تنشئ لعبة جديدة مليئة بالمعاملات الصغيرة. مع لعبتك الجديدة تكسب مجموع",
"تعمل كممثل صوتي لشخصية سبونج بوب وتمكنت من كسب",
"كنت تزرع وكسبت",
"تعمل كباني قلاع رملية وتكسب",
"عملت وكسبت",
"تعمل كفنانة شارع وتكسب",
"قمت بعمل اجتماعي لسبب جيد! من أجل سببك الجيد حصلت"
,"مطور مواقع ويب", "مطور العاب", "احد مطورين فوكس بوت 🌚", "مساعد تنسيق في فوكس بوت", "مساعد مشرف علي مجموعات يوسف السلطان", "مطور العاب", "عملت في منجم", "منظم حفلات من اجل الحصول علي",
 "مساعد طبيب ", "تعمل كطباخ", 
"تعمل كمهندس ", 
"تعمل كطبيب", 
"تعمل في بنك ", 
"جاء شخص ما وأقام مسرحية وانت عملت كاحد طاقميها", "قمت بشراء وبيع العناصر وكسبت", 
"تعمل في بيتزا هوت وتكسب", 
"انت تعمل ككاتب وتكسب", "تذهب من خلال حقيبتك وتقرر بيع بعض العناصر غير المفيدة التي لا تحتاج إليها. تبين أن كل هذا الهراء كان يستحق", 
"تساعد محتاج وتحصل", 
"أنت تطور الألعاب من أجل لقمة العيش وتفوز", 
"لقد ربحت مسابقة أكل الفلفل الحار. الجائزة", 
"تعمل طوال اليوم في شركه وتربح", 
"تنضم لفريق فوكس والحزا *ES* وتحصل علي", "لقد صممت شعار تيم فوكس *ES* وحصلت علي", 
"لقد قمت بالاشراف علي مجموعه *ES* عندما لم يكن موجود تفوز ب ", 
"لقد عمل بأفضل ما لديه في شركة طباعة كانت توظف وحصلت علي", 
"احد افراد تيم فوكس *ES*", "لقد زاد الطلب على ألعاب الأجهزة المحمولة ، لذا يمكنك إنشاء لعبة جديدة مليئة بالمعاملات الصغيرة. مع لعبتك الجديدة تكسب", 
"أنت تعمل كممثل صوتي لـسبونج بوب وتمكنت من الفوز ب ", 
"كنت تزرع وفزت ب", "تبني قلعة رملية وتربح", "لقد عملت وربحت", 
"تعمل كصانع لوجوهات لتيم فوكس وتحصل علي","تعمل كبلوجر وتحصل علي", 
"تعمل علي بريمير لتعديل الفديوهات وتحصل علي"]
